FVM/Droplet-Microfluidics/3D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  Wall
  {
      type            zeroGradient;
  }
  Inlet
  {
      type            zeroGradient;
  }
  Outlet1
  {
      type            fixedValue;
      value           uniform 10;
  }
  Outlet2
  {
      type            fixedValue;
      value           uniform 0;
  }
}

// ************************************************************************* //
