FVM/Droplet-Microfluidics/3D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water oil);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

oil
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}
sigma            0.005;

// ************************************************************************* //
