FVM/Droplet-Microfluidics/3D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (2.5e-6 5e-6 5e-6)(1.975e-4 9.5e-5 9.5e-5);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    /*
    sphereToCell
    {
        centre (8e-5 5e-5 5e-5);
        radius 2.5e-5;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    */
);


// ************************************************************************* //
